{"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 10, 80, 320, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"border_mode": "valid", "name": "maxpooling3d_1", "dim_ordering": "tf", "strides": [1, 2, 2], "pool_size": [1, 2, 2], "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "maxpooling3d_1"}, {"config": {"b_constraint": null, "kernel_dim1": 5, "b_regularizer": null, "kernel_dim3": 5, "dim_ordering": "tf", "subsample": [1, 1, 1], "name": "convolution3d_1", "W_constraint": null, "W_regularizer": null, "trainable": true, "init": "he_normal", "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_filter": 60, "kernel_dim2": 5, "activation": "relu"}, "class_name": "Convolution3D", "inbound_nodes": [[["maxpooling3d_1", 0, 0]]], "name": "convolution3d_1"}, {"config": {"border_mode": "valid", "name": "maxpooling3d_2", "dim_ordering": "tf", "strides": [2, 3, 3], "pool_size": [2, 3, 3], "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["convolution3d_1", 0, 0]]], "name": "maxpooling3d_2"}, {"config": {"name": "spatialdropout3d_1", "p": 0.5, "trainable": true}, "class_name": "SpatialDropout3D", "inbound_nodes": [[["maxpooling3d_2", 0, 0]]], "name": "spatialdropout3d_1"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "axis": 4, "name": "batchnormalization_1", "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["spatialdropout3d_1", 0, 0]]], "name": "batchnormalization_1"}, {"config": {"b_constraint": null, "kernel_dim1": 3, "b_regularizer": null, "kernel_dim3": 3, "dim_ordering": "tf", "subsample": [1, 1, 1], "name": "convolution3d_2", "W_constraint": null, "W_regularizer": null, "trainable": true, "init": "he_normal", "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_filter": 120, "kernel_dim2": 3, "activation": "relu"}, "class_name": "Convolution3D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution3d_2"}, {"config": {"border_mode": "valid", "name": "maxpooling3d_3", "dim_ordering": "tf", "strides": [2, 3, 2], "pool_size": [2, 3, 2], "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["convolution3d_2", 0, 0]]], "name": "maxpooling3d_3"}, {"config": {"name": "spatialdropout3d_2", "p": 0.5, "trainable": true}, "class_name": "SpatialDropout3D", "inbound_nodes": [[["maxpooling3d_3", 0, 0]]], "name": "spatialdropout3d_2"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "axis": 4, "name": "batchnormalization_2", "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["spatialdropout3d_2", 0, 0]]], "name": "batchnormalization_2"}, {"config": {"b_constraint": null, "kernel_dim1": 3, "b_regularizer": null, "kernel_dim3": 3, "dim_ordering": "tf", "subsample": [1, 1, 1], "name": "convolution3d_3", "W_constraint": null, "W_regularizer": null, "trainable": true, "init": "he_normal", "border_mode": "same", "bias": true, "activity_regularizer": null, "nb_filter": 180, "kernel_dim2": 3, "activation": "relu"}, "class_name": "Convolution3D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution3d_3"}, {"config": {"border_mode": "valid", "name": "maxpooling3d_4", "dim_ordering": "tf", "strides": [2, 3, 2], "pool_size": [2, 3, 2], "trainable": true}, "class_name": "MaxPooling3D", "inbound_nodes": [[["convolution3d_3", 0, 0]]], "name": "maxpooling3d_4"}, {"config": {"name": "spatialdropout3d_3", "p": 0.5, "trainable": true}, "class_name": "SpatialDropout3D", "inbound_nodes": [[["maxpooling3d_4", 0, 0]]], "name": "spatialdropout3d_3"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "axis": 4, "name": "batchnormalization_3", "trainable": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["spatialdropout3d_3", 0, 0]]], "name": "batchnormalization_3"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "flatten_1"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 2340, "name": "dense_1", "output_dim": 256, "activation": "linear", "batch_input_shape": [null, 2340]}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"config": {"init": "zero", "trainable": true, "name": "prelu_1"}, "class_name": "PReLU", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "prelu_1"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["prelu_1", 0, 0]]], "name": "dropout_1"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 256, "name": "dense_2", "output_dim": 1, "activation": "linear", "batch_input_shape": [null, 256]}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2"}]}, "class_name": "Model", "keras_version": "1.2.0"}
