{"keras_version": "1.2.0", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 10, 80, 320, 3]}, "class_name": "InputLayer"}, {"name": "maxpooling3d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"border_mode": "valid", "strides": [1, 2, 2], "name": "maxpooling3d_1", "pool_size": [1, 2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling3D"}, {"name": "convolution3d_1", "inbound_nodes": [[["maxpooling3d_1", 0, 0]]], "config": {"border_mode": "same", "activity_regularizer": null, "name": "convolution3d_1", "subsample": [1, 1, 1], "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "kernel_dim2": 5, "dim_ordering": "tf", "activation": "relu", "kernel_dim3": 5, "kernel_dim1": 5, "W_regularizer": null, "nb_filter": 60}, "class_name": "Convolution3D"}, {"name": "maxpooling3d_2", "inbound_nodes": [[["convolution3d_1", 0, 0]]], "config": {"border_mode": "valid", "strides": [2, 3, 3], "name": "maxpooling3d_2", "pool_size": [2, 3, 3], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling3D"}, {"name": "spatialdropout3d_1", "inbound_nodes": [[["maxpooling3d_2", 0, 0]]], "config": {"p": 0.5, "name": "spatialdropout3d_1", "trainable": true}, "class_name": "SpatialDropout3D"}, {"name": "batchnormalization_1", "inbound_nodes": [[["spatialdropout3d_1", 0, 0]]], "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "axis": 4, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "convolution3d_2", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"border_mode": "same", "activity_regularizer": null, "name": "convolution3d_2", "subsample": [1, 1, 1], "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "kernel_dim2": 3, "dim_ordering": "tf", "activation": "relu", "kernel_dim3": 3, "kernel_dim1": 3, "W_regularizer": null, "nb_filter": 80}, "class_name": "Convolution3D"}, {"name": "maxpooling3d_3", "inbound_nodes": [[["convolution3d_2", 0, 0]]], "config": {"border_mode": "valid", "strides": [2, 3, 3], "name": "maxpooling3d_3", "pool_size": [2, 3, 3], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling3D"}, {"name": "spatialdropout3d_2", "inbound_nodes": [[["maxpooling3d_3", 0, 0]]], "config": {"p": 0.5, "name": "spatialdropout3d_2", "trainable": true}, "class_name": "SpatialDropout3D"}, {"name": "batchnormalization_2", "inbound_nodes": [[["spatialdropout3d_2", 0, 0]]], "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "axis": 4, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "convolution3d_3", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"border_mode": "same", "activity_regularizer": null, "name": "convolution3d_3", "subsample": [1, 1, 1], "W_constraint": null, "b_constraint": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "kernel_dim2": 3, "dim_ordering": "tf", "activation": "relu", "kernel_dim3": 3, "kernel_dim1": 3, "W_regularizer": null, "nb_filter": 120}, "class_name": "Convolution3D"}, {"name": "maxpooling3d_4", "inbound_nodes": [[["convolution3d_3", 0, 0]]], "config": {"border_mode": "valid", "strides": [2, 3, 3], "name": "maxpooling3d_4", "pool_size": [2, 3, 3], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling3D"}, {"name": "spatialdropout3d_3", "inbound_nodes": [[["maxpooling3d_4", 0, 0]]], "config": {"p": 0.5, "name": "spatialdropout3d_3", "trainable": true}, "class_name": "SpatialDropout3D"}, {"name": "batchnormalization_3", "inbound_nodes": [[["spatialdropout3d_3", 0, 0]]], "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "axis": 4, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "flatten_1", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"activity_regularizer": null, "name": "dense_1", "W_constraint": null, "batch_input_shape": [null, 600], "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activation": "linear", "input_dim": 600, "W_regularizer": null, "input_dtype": "float32", "output_dim": 256}, "class_name": "Dense"}, {"name": "prelu_1", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"init": "zero", "name": "prelu_1", "trainable": true}, "class_name": "PReLU"}, {"name": "dropout_1", "inbound_nodes": [[["prelu_1", 0, 0]]], "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"activity_regularizer": null, "name": "dense_2", "W_constraint": null, "batch_input_shape": [null, 256], "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activation": "linear", "input_dim": 256, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "input_dtype": "float32", "output_dim": 1}, "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model"}
